todo_with_rspec/app/controllers/tasks_controller.rb

  def create
    @task = Task.create(task_params)
---
INSERT INTO "tasks" ("name", "priority", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Learn Rspec"], ["priority", 1], ["created_at", 2018-03-25 00:27:56 UTC], ["updated_at", 2018-03-25 00:27:56 UTC]]

  def edit
    # byebug
    @task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @task = Task.find(params[:id])
    @task.update(task_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "name" = ?, "priority" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["name", "buy beer"], ["priority", 2], ["updated_at", 2018-03-25 00:58:32 UTC], ["id", 1]]

  def destroy
    Task.destroy(params[:id])
---
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]